# დავალება 4:
# შეადგინეთ ფსევდოკოდი ისეთი შემთხვევისთვის, როდესაც გვაქვს 5 ელემენტიანი (არ გვაქვს დუპლიკატები) მასივი და ვითვლით საშუალო მინიჭების რაოდენობას. HINT: გამოიყენეთ მეორე დავალების ფსევდოკოდის ნაწილი

# def average2(lllist):
#     return sum(lllist)//len(lllist)
# print(average2([1,5,10,23,52,4]))

def average1(llist):
    return len(llist) * len(llist)
print(average1([1,5,10,23,542,4]))

def average3(llllist):
    count = 0
    for a in range(len(llllist)):
        for b in range(len(llllist)):
            count += 1
    return count
print(average3([1,2,3,4,5]))

# 1.ჩვენს ფუნქციაში ვქმნით ცვლადს სახელად count.
# 2.ჩვენს ფუნქციას გადავცემთ ცვლადს [1,2,3,4,5].
# 3.ვიყენებთ 2 ციკლს,პირველ ციკლს ვუვლით საიტერაციო ცვლადით[a],მეორე ციკლს კი საეტერაციო ცლადი[b]-თი.
# 4.ყოველ იტერაციის შემდეგ count ცვლადი მოიმატებს 1-ით.
# 5.საბოლოოდ გამოგვაქ count ცვლადი რომელიც შეიცავს ელემენტების მინიჭების რაოდებობას.
