#შექმენით პროგრამა, სადაც გადმოგეცემათ სიები და თქვენ მოახდენთ ფილტრაციას.
#თუ პირველ და მეორე სიაში ერთი და იგივე ინდექსზე მყოფი ელემენტი იგივე იქნება, მთვლელს დაამატეთ 4 ქულა.
#თუ რომელიმე ელემენტი იქნება "" - ანუ ცარიელი სთრინგი, მთვლელი არ შეცვალოთ.
#ხოლო თუ გექნებათ განსხვავებული ელემენტები, მთვლელს გამოაკელით ერთი ქულა. იმუშავეთ შემდეგ სიებზე: 

#["a", "a", "b", "b"], ["a", "c", "b", "d"]
#["a", "a", "c", "b"], ["a", "a", "b",  ""]
#["a", "a", "b", "c"], ["a", "a", "b", "c"]
#["b", "c", "b", "a"], ["",  "a", "a", "c"]

#test cases:
#["a", "a", "b", "b"], ["a", "c", "b", "d"]) → 6
#["a", "a", "c", "b"], ["a", "a", "b",  ""]) → 7
#["a", "a", "b", "c"], ["a", "a", "b", "c"]) → 16
#["b", "c", "b", "a"], ["",  "a", "a", "c"]) → 0

#first_list = ["a","g","d","t"], ["a","j","d","z"]
#second_list = ["o","e","h",""], ["o","e","h",""]

n1 = ["a","g","d","t"]
n2 = ["a","j","d","z"]
qulebi = 0
for i in n1:
    if i in n2:
        qulebi += 4
    else:
        qulebi -= 1
        
print(qulebi)